# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [25]:
# import libraries here
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [26]:
# your code here
temp=pd.read_csv("Temp_States.csv")
temp.shape

(7, 3)

#### Print `temp`.

In [27]:
# your code here
display(temp)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [28]:
# your code here
temp_data_types = temp.dtypes
temp_data_types

City            object
State           object
Temperature    float64
dtype: object

In [29]:
"""
your comments here
The temp dataset has two string data types (City and State) and one float data type (Temperature)
"""

'\nyour comments here\nThe temp dataset has two string data types (City and State) and one float data type (Temperature)\n'

#### Select the rows where state is New York.

In [30]:
# your code here
new_york=temp[(temp['State']=='New York')]
new_york

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [31]:
# your code here
temp.groupby(['State']).agg({'Temperature':'mean'})

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

#### Which states and cities have a temperature above 15 degrees Celsius?

In [22]:
# your code here
#Creating a Boolean masks
temp['Temperature']>15

0     True
1    False
2    False
3     True
4    False
5     True
6     True
Name: Temperature, dtype: bool

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [34]:
# your code here
# Filter the DF to return cities with temperature above 15 degrees Celsius
Cities= temp[temp['Temperature'] > 15]

display(Cities)

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [40]:
# your code here
Mid_Cities=temp[(temp['Temperature']<20) & (temp['Temperature']>15)]

display(Mid_Cities)

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [43]:
# your code here

In [51]:
temp.groupby('State')['Temperature'].mean()

State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741
Name: Temperature, dtype: float64

In [52]:
 temp.groupby('State')['Temperature'].std()

State
Connecticut    1.964186
New Jersey     1.571348
New York       8.133404
Name: Temperature, dtype: float64

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [54]:
# your code here
employees=pd.read_csv('Employee.csv')
display (employees)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [53]:
# your code here
employees_data_types = employees.dtypes
employees_data_types

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
your comments here
"""

#### What's the average salary in this company?

In [55]:
# your code here
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [56]:
# your code here
employees['Salary'].max()

70

#### What's the lowest salary?

In [57]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [62]:
# your code here
employees[employees['Salary'] == employees['Salary'].min()]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [63]:
# your code here
employees[(employees['Name']=='David')]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [65]:
# your code here
employees['Salary'].iloc[2]

30

#### Print all the rows where job title is associate.

In [66]:
# your code here
employees[(employees['Title'] == 'associate')]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [68]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [69]:
# Method 2
# your code here
employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [71]:
# your code here
employees[(employees['Title']=='associate') & (employees['Salary']>55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [72]:
# your code here
employees.groupby(['Years']).agg({"Salary":"mean"})

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [73]:
# your code here
employees.groupby(["Title"]).agg({"Salary":"mean"})

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [77]:
# your code here
q1=np.quantile(employees['Salary'],0.25)
q2=np.quantile(employees['Salary'],0.5)
q3=np.quantile(employees['Salary'],0.75)
q4=np.quantile(employees['Salary'],1)

print(q1)
print(q2)
print(q3)
print(q4)

35.0
55.0
60.0
70

#### Is the mean salary different per gender?

In [79]:
# your code here
employees.groupby(['Gender']).agg({"Salary":"mean"})

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [89]:
# your code here
Numeric=employees.groupby(["Department"]).agg({"Salary":["min","max","mean"],"Years":["min","max","mean"]})
Numeric.columns= [f'{col}_{agg}' for col, agg in Numeric.columns]

# Display the result
display(Numeric)

,Salary_min,Salary_max,Salary_mean,Years_min,Years_max,Years_mean
Department,,,,,,
HR,30,70,45.00,2,8,4.666667
IT,30,70,48.75,1,8,4.500000
Sales,55,55,55.00,2,3,2.500000

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here